; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-5nodes-1000size-4degree-100mindistance-2trucks-6packages-1090seed

(define (problem transport-two-cities-sequential-5nodes-1000size-4degree-100mindistance-2trucks-6packages-1090seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  package-6 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 401,371 -> 463,153
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 23)
  ; 463,153 -> 401,371
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 23)
  ; 699,227 -> 463,153
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 25)
  ; 463,153 -> 699,227
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 25)
  ; 699,227 -> 401,371
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 34)
  ; 401,371 -> 699,227
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 34)
  ; 959,71 -> 463,153
  (road city-1-loc-4 city-1-loc-1)
  (= (road-length city-1-loc-4 city-1-loc-1) 51)
  ; 463,153 -> 959,71
  (road city-1-loc-1 city-1-loc-4)
  (= (road-length city-1-loc-1 city-1-loc-4) 51)
  ; 959,71 -> 699,227
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 31)
  ; 699,227 -> 959,71
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 31)
  ; 747,615 -> 463,153
  (road city-1-loc-5 city-1-loc-1)
  (= (road-length city-1-loc-5 city-1-loc-1) 55)
  ; 463,153 -> 747,615
  (road city-1-loc-1 city-1-loc-5)
  (= (road-length city-1-loc-1 city-1-loc-5) 55)
  ; 747,615 -> 401,371
  (road city-1-loc-5 city-1-loc-2)
  (= (road-length city-1-loc-5 city-1-loc-2) 43)
  ; 401,371 -> 747,615
  (road city-1-loc-2 city-1-loc-5)
  (= (road-length city-1-loc-2 city-1-loc-5) 43)
  ; 747,615 -> 699,227
  (road city-1-loc-5 city-1-loc-3)
  (= (road-length city-1-loc-5 city-1-loc-3) 40)
  ; 699,227 -> 747,615
  (road city-1-loc-3 city-1-loc-5)
  (= (road-length city-1-loc-3 city-1-loc-5) 40)
  ; 747,615 -> 959,71
  (road city-1-loc-5 city-1-loc-4)
  (= (road-length city-1-loc-5 city-1-loc-4) 59)
  ; 959,71 -> 747,615
  (road city-1-loc-4 city-1-loc-5)
  (= (road-length city-1-loc-4 city-1-loc-5) 59)
  ; 2032,615 -> 2095,504
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 13)
  ; 2095,504 -> 2032,615
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 13)
  ; 2353,314 -> 2095,504
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 32)
  ; 2095,504 -> 2353,314
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 32)
  ; 2353,314 -> 2032,615
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 44)
  ; 2032,615 -> 2353,314
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 44)
  ; 2315,715 -> 2095,504
  (road city-2-loc-5 city-2-loc-1)
  (= (road-length city-2-loc-5 city-2-loc-1) 31)
  ; 2095,504 -> 2315,715
  (road city-2-loc-1 city-2-loc-5)
  (= (road-length city-2-loc-1 city-2-loc-5) 31)
  ; 2315,715 -> 2032,615
  (road city-2-loc-5 city-2-loc-2)
  (= (road-length city-2-loc-5 city-2-loc-2) 30)
  ; 2032,615 -> 2315,715
  (road city-2-loc-2 city-2-loc-5)
  (= (road-length city-2-loc-2 city-2-loc-5) 30)
  ; 2315,715 -> 2353,314
  (road city-2-loc-5 city-2-loc-3)
  (= (road-length city-2-loc-5 city-2-loc-3) 41)
  ; 2353,314 -> 2315,715
  (road city-2-loc-3 city-2-loc-5)
  (= (road-length city-2-loc-3 city-2-loc-5) 41)
  ; 2315,715 -> 2697,968
  (road city-2-loc-5 city-2-loc-4)
  (= (road-length city-2-loc-5 city-2-loc-4) 46)
  ; 2697,968 -> 2315,715
  (road city-2-loc-4 city-2-loc-5)
  (= (road-length city-2-loc-4 city-2-loc-5) 46)
  ; 959,71 <-> 2032,615
  (road city-1-loc-4 city-2-loc-2)
  (= (road-length city-1-loc-4 city-2-loc-2) 121)
  (road city-2-loc-2 city-1-loc-4)
  (= (road-length city-2-loc-2 city-1-loc-4) 121)
  (at package-1 city-1-loc-5)
  (at package-2 city-1-loc-1)
  (at package-3 city-1-loc-4)
  (at package-4 city-1-loc-5)
  (at package-5 city-1-loc-5)
  (at package-6 city-1-loc-5)
  (at truck-1 city-2-loc-5)
  (capacity truck-1 capacity-3)
  (at truck-2 city-2-loc-2)
  (capacity truck-2 capacity-4)
 )
 (:goal (and
  (at package-1 city-2-loc-3)
  (at package-2 city-2-loc-2)
  (at package-3 city-2-loc-3)
  (at package-4 city-2-loc-1)
  (at package-5 city-2-loc-1)
  (at package-6 city-2-loc-3)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-2 city-2-loc-2 city-1-loc-4)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-1-loc-4)
   goals met: 0 of 6
2. (drive truck-2 city-1-loc-4 city-1-loc-5)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-1-loc-5)
   goals met: 0 of 6
3. (pick-up truck-2 city-1-loc-5 package-6 capacity-3 capacity-4)
   deleted: (at package-6 city-1-loc-5) (capacity truck-2 capacity-4)
   added: (in package-6 truck-2) (capacity truck-2 capacity-3)
   goals met: 0 of 6
4. (pick-up truck-2 city-1-loc-5 package-5 capacity-2 capacity-3)
   deleted: (at package-5 city-1-loc-5) (capacity truck-2 capacity-3)
   added: (in package-5 truck-2) (capacity truck-2 capacity-2)
   goals met: 0 of 6
5. (pick-up truck-2 city-1-loc-5 package-4 capacity-1 capacity-2)
   deleted: (at package-4 city-1-loc-5) (capacity truck-2 capacity-2)
   added: (in package-4 truck-2) (capacity truck-2 capacity-1)
   goals met: 0 of 6
6. (pick-up truck-2 city-1-loc-5 package-1 capacity-0 capacity-1)
   deleted: (at package-1 city-1-loc-5) (capacity truck-2 capacity-1)
   added: (in package-1 truck-2) (capacity truck-2 capacity-0)
   goals met: 0 of 6
7. (drive truck-2 city-1-loc-5 city-1-loc-4)
   deleted: (at truck-2 city-1-loc-5)
   added: (at truck-2 city-1-loc-4)
   goals met: 0 of 6
8. (drive truck-2 city-1-loc-4 city-2-loc-2)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-2-loc-2)
   goals met: 0 of 6
9. (drive truck-2 city-2-loc-2 city-2-loc-1)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-2-loc-1)
   goals met: 0 of 6
10. (drop truck-2 city-2-loc-1 package-5 capacity-0 capacity-1)
   deleted: (in package-5 truck-2) (capacity truck-2 capacity-0)
   added: (at package-5 city-2-loc-1) (capacity truck-2 capacity-1)
   goals met: 1 of 6
11. (drop truck-2 city-2-loc-1 package-4 capacity-1 capacity-2)
   deleted: (in package-4 truck-2) (capacity truck-2 capacity-1)
   added: (at package-4 city-2-loc-1) (capacity truck-2 capacity-2)
   goals met: 2 of 6
12. (drive truck-2 city-2-loc-1 city-2-loc-2)
   deleted: (at truck-2 city-2-loc-1)
   added: (at truck-2 city-2-loc-2)
   goals met: 2 of 6
13. (drive truck-2 city-2-loc-2 city-1-loc-4)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-1-loc-4)
   goals met: 2 of 6
14. (pick-up truck-2 city-1-loc-4 package-3 capacity-1 capacity-2)
   deleted: (at package-3 city-1-loc-4) (capacity truck-2 capacity-2)
   added: (in package-3 truck-2) (capacity truck-2 capacity-1)
   goals met: 2 of 6
15. (drive truck-2 city-1-loc-4 city-1-loc-1)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-1-loc-1)
   goals met: 2 of 6
16. (pick-up truck-2 city-1-loc-1 package-2 capacity-0 capacity-1)
   deleted: (at package-2 city-1-loc-1) (capacity truck-2 capacity-1)
   added: (in package-2 truck-2) (capacity truck-2 capacity-0)
   goals met: 2 of 6
17. (drive truck-2 city-1-loc-1 city-1-loc-4)
   deleted: (at truck-2 city-1-loc-1)
   added: (at truck-2 city-1-loc-4)
   goals met: 2 of 6
18. (drive truck-2 city-1-loc-4 city-2-loc-2)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-2-loc-2)
   goals met: 2 of 6
19. (drop truck-2 city-2-loc-2 package-2 capacity-0 capacity-1)
   deleted: (in package-2 truck-2) (capacity truck-2 capacity-0)
   added: (at package-2 city-2-loc-2) (capacity truck-2 capacity-1)
   goals met: 3 of 6
20. (drive truck-2 city-2-loc-2 city-2-loc-3)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-2-loc-3)
   goals met: 3 of 6
21. (drop truck-2 city-2-loc-3 package-1 capacity-1 capacity-2)
   deleted: (in package-1 truck-2) (capacity truck-2 capacity-1)
   added: (at package-1 city-2-loc-3) (capacity truck-2 capacity-2)
   goals met: 4 of 6
22. (drop truck-2 city-2-loc-3 package-3 capacity-2 capacity-3)
   deleted: (in package-3 truck-2) (capacity truck-2 capacity-2)
   added: (at package-3 city-2-loc-3) (capacity truck-2 capacity-3)
   goals met: 5 of 6
23. (drop truck-2 city-2-loc-3 package-6 capacity-3 capacity-4)
   deleted: (in package-6 truck-2) (capacity truck-2 capacity-3)
   added: (at package-6 city-2-loc-3) (capacity truck-2 capacity-4)
   goals met: 6 of 6
